app/controllers/lessons_controller.rb

  def index
    @lessons = Lesson.all
---
SELECT "lessons".* FROM "lessons"

  def show
    @lesson = Lesson.find(params[:id])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT 1  [["id", 16]]

  def submit
    if params[:realacesubmit] != nil and params[:realacesubmit] != ""
      @result = Lesson.find(params[:lessonid]).check_submission(params[:realacesubmit])
---
SELECT  "lessons".* FROM "lessons" WHERE "lessons"."id" = $1 LIMIT 1  [["id", nil]]